Revit 2026 API

# DocumentRegenerate Method

---

Updates the elements in the Revit document to reflect all changes.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Regenerate()
```
```vb
Public Sub Regenerate
```
```cpp
public:
void Regenerate()
```
```fsharp
member Regenerate : unit -> unit
```

| Exception | Condition |
| --- | --- |
| RegenerationFailedException | Thrown when the operation fails. |

  * If regeneration fails, there is posted error of severity DocumentCorruption that will be delivered to the end user at the end of transaction explaining what specifically has happened.
  * If regeneration has failed, document is corrupted and even reading from it is illegal.
  * Code that called regeneration and got this exception should not catch and ignore it - instead, it should do nothing but internal cleanup and return control to the owner of currently active transaction/subtransaction, which must be aborted.

| InvalidOperationException | Modification of the document is forbidden. Typically, this is because there is no open transaction; consult documentation for Document.IsModified for other possible causes. |

Use this method to force update to the document after a group of changes. Note that when a transaction is committed there is an automatic call to regenerate the document.

#### Reference

Document Class

Autodesk.Revit.DB Namespace